RIET/src/Documents/СписаниеДанныхКнигиПокупок/СписаниеДанныхКнигиПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеДанныхКнигиПокупок</name>
  <registerRecords>AccumulationRegister.ДанныеКнигиПокупок</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РегистрацияПП</types>
        <types>DocumentRef.ЗакрытиеПредоплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЗатрат</name>
      <type>
        <types>CatalogRef.ОписаниеЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПрихода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрихода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлатежныйЦентр</name>
      <type>
        <types>CatalogRef.PayableCentres</types>
      </type>
    </attributes>
    <attributes>
      <name>ПО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВаучера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ДанныеКнигиПокупок/ДанныеКнигиПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеКнигиПокупок</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РегистрацияПП</types>
      <types>DocumentRef.ЗакрытиеПредоплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеЗатрат</name>
    <type>
      <types>CatalogRef.ОписаниеЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПрихода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлатежныйЦентр</name>
    <type>
      <types>CatalogRef.PayableCentres</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВаучера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/СписаниеДанныхКнигиПокупок/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		// register ДанныеКнигиПокупок Расход
		Движение = Движения.ДанныеКнигиПокупок.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Документ = ТекСтрокаДанные.Документ;
		Движение.ОписаниеЗатрат = ТекСтрокаДанные.ОписаниеЗатрат;
		Движение.Поставщик = ТекСтрокаДанные.Поставщик;
		Движение.НомерПрихода = ТекСтрокаДанные.НомерПрихода;
		Движение.ДатаПрихода = ТекСтрокаДанные.ДатаПрихода;
		Движение.ПлатежныйЦентр = ТекСтрокаДанные.ПлатежныйЦентр;
		Движение.ПО = ТекСтрокаДанные.ПО;
		Движение.НомерСчета = ТекСтрокаДанные.НомерСчета;
		Движение.НомерВаучера = ТекСтрокаДанные.НомерВаучера;
		Движение.Валюта = ТекСтрокаДанные.Валюта;
		Движение.Сумма = ТекСтрокаДанные.Сумма;
	КонецЦикла;
	// writing register movements
	Движения.ДанныеКнигиПокупок.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
